[
	{
		"title": "Chili's parent CEO: Why half-pound burgers are a hot seller amid high inflation",
		"keyword": [
			"Brinker International",
			"Chili&#39;s",
			"Olive Garden"
		],
		"provider": "Yahoo Finance",
		"datepublished": "2023-05-09T12:15:59.000Z",
		"content": [
			"Chili's extra-large, half-pound <a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:burgers;cpos:1;pos:1;elm:context_link;itc:0\" href=\"https://pnr.ouryahoo.com/story/yahoo_finance_us/5f7777fa-b66b-46a6-b486-86dfc2ad9b88\" rel=\"sponsored\" target=\"_blank\">burgers</a> and Maggiano's heaping <a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:pasta bowls;cpos:2;pos:1;elm:context_link;itc:0\" href=\"https://www.maggianos.com/\" rel=\"sponsored\" target=\"_blank\">pasta bowls</a> are having moments for parent company Brinker International (<a class=\"link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:EAT;cpos:3;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/quote/EAT?p=EAT&amp;fr=sycsrp_catchall\">EAT</a>).",
			"Credit that to inflation-ravaged middle-income diners seeking refuge in big portion sizes at reasonable prices when splurging to eat out, says Brinker International CEO <a class=\"link yahoo-link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:Kevin Hochman;cpos:4;pos:1;elm:context_link;itc:0;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/video/brinker-ceo-growth-channel-chili-161426624.html\">Kevin Hochman</a>.",
			"\"Value is really important. Customers are smart. Our guests come in, and they don't want to get nickel and dimed,\" Hochman said on <a class=\"link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:Yahoo! Finance Live;cpos:5;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/videos\">Yahoo! Finance Live</a> (video above).",
			"It's hard to argue diners at Chili's are getting ripped off on the <a class=\"link\" data-i13n=\"cpos:6;pos:1\" data-ylk=\"slk:Big Bacon BBQ burger;cpos:6;pos:1;elm:context_link;itc:0\" href=\"https://www.chilis.com/menu/big-mouth-burgers/big-bacon-bbq-burger\" rel=\"sponsored\" target=\"_blank\">Big Bacon BBQ burger</a>. At a cost of $17.19, you get nearly 1,700 calories, consisting of two enormous patties, six slices of bacon, BBQ sauce, cheddar cheese, red onion, pickles, and a side of fries.",
			"For a value-focused restaurant player such as Brinker, giving diners more bang for their buck worked out well in the first quarter.",
			"Same-restaurant sales at Chili's and Maggiano's rose a hearty 9.6% and 21.6%, respectively. The company said the sales gains were fueled by higher menu prices and more orders of premium items like that Big Bacon BBQ burger.",
			"Operating profit margins for Brinker rose to 13.4% from 13.1% a year ago. Margins improved year over year at both Chili's and Maggiano's.",
			"Earnings per share surged 34% from a year earlier.",
			"Serving up feasts at a great price has also worked out well for long-time Brinker International competitor Darden (<a class=\"link\" data-i13n=\"cpos:7;pos:1\" data-ylk=\"slk:DRI;cpos:7;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/quote/DRI/?fr=sycsrp_catchall\">DRI</a>), owner of value chains Olive Garden and Longhorn Steakhouse.",
			"Same-restaurant sales at Olive Garden rose 12.3% in the most recent quarter, followed by a 10.8% increase at Longhorn Steakhouse.",
			"Operating profits increased 16% from a year ago for Darden.",
			"\"Consumers continue to seek value, which is not about low prices,\" Darden CEO Rick Cardenas told analysts on an earnings call.",
			"Shares of Brinker International and Darden are up 16% and 11%, respectively this year, compared to a 7.7% gain for the S&amp;P 500.",
			"Successful quarters (and as a result, favorable stock-price reactions) for some of the country's largest sit-down restaurant chains come amid growing economic stress on lower-income to middle-income diners.",
			"These cohorts have taken to cutting back on items purchased at fast-food chains such as McDonald's (<a class=\"link\" data-i13n=\"cpos:8;pos:1\" data-ylk=\"slk:MCD;cpos:8;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/quote/MCD?fr=sycsrp_catchall\">MCD</a>) and Berkshire Hathaway (<a class=\"link\" data-i13n=\"cpos:9;pos:1\" data-ylk=\"slk:BRK-A;cpos:9;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/quote/BRK-A?p=BRK-A&amp;.tsrc=fin-srch\">BRK-A</a>, <a class=\"link\" data-i13n=\"cpos:10;pos:1\" data-ylk=\"slk:BRK-B;cpos:10;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/quote/BRK-B?p=BRK-B&amp;.tsrc=fin-srch\">BRK-B</a>) owned <a class=\"link yahoo-link\" data-i13n=\"cpos:11;pos:1\" data-ylk=\"slk:Dairy Queen;cpos:11;pos:1;elm:context_link;itc:0;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/video/why-dairy-queen-popular-around-205414939.html\">Dairy Queen</a>.",
			"The read may be that these cash-strapped diners see greater overall value in spending a little more sitting down to eat at a Chili's or Olive Garden for all-you-can-eat breadsticks or a 1,700-calorie burger and fries for under $20.",
			"A less stomach-filling McDonald's Big Mac, fries, and soda could set you back more than $15, depending on where you live.",
			"Says Brinker's Hochman, \"Guests know when they are getting a fair deal and they are getting abundant quality.\"",
			"<a class=\"link\" data-i13n=\"cpos:12;pos:1\" data-ylk=\"slk:Brian Sozzi;cpos:12;pos:1;elm:context_link;itc:0\" href=\"https://www.yahoo.com/author/brian-sozzi/\"><em>Brian Sozzi</em></a><em> is Yahoo Finance's Executive Editor. Follow Sozzi on Twitter </em><a class=\"link\" data-i13n=\"cpos:13;pos:1\" data-ylk=\"slk:@BrianSozzi;cpos:13;pos:1;elm:context_link;itc:0\" href=\"https://twitter.com/BrianSozzi\" rel=\"sponsored\" target=\"_blank\"><em>@BrianSozzi</em></a><em> and on </em><a class=\"link\" data-i13n=\"cpos:14;pos:1\" data-ylk=\"slk:LinkedIn;cpos:14;pos:1;elm:context_link;itc:0\" href=\"https://www.linkedin.com/in/briansozzi/\" rel=\"sponsored\" target=\"_blank\"><em>LinkedIn</em></a><em>. Tips on deals, mergers, activist situations or anything else? Email brian.sozzi@yahoofinance.com</em>",
			"<a class=\"link\" data-i13n=\"cpos:15;pos:1\" data-ylk=\"slk:Click here for the latest stock market news and in-depth analysis, including events that move stocks;cpos:15;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/topic/stock-market-news/\"><strong>Click here for the latest stock market news and in-depth analysis, including events that move stocks</strong></a>",
			"<a class=\"link\" data-i13n=\"cpos:16;pos:1\" data-ylk=\"slk:Read the latest financial and business news from Yahoo Finance;cpos:16;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/news/\"><strong>Read the latest financial and business news from Yahoo Finance</strong></a>"
		]
	},
	{
		"title": "Amazon Wants Customers To Change Shipping Habit and Will Pay Them To Do It",
		"keyword": [
			"Amazon",
			"Amazon Fresh",
			"Amazon Prime",
			"Amazon lockers",
			"Amazon Day"
		],
		"provider": "TheStreet.com",
		"datepublished": "2023-05-09T15:31:00.000Z",
		"content": [
			"Amazon - is urging customers to change the way they receive their orders in order to cut future costs. Amazon's move can not only help shipping costs but also improve workflow and efficiency for its deliveries. It also trains users in making direct returns by teaching them of the locations of Amazon's hubs."
		]
	},
	{
		"title": "2 Magnificent Stocks to Buy In a Bear Market",
		"keyword": [
			"Starbucks",
			"McDonald&#39;s",
			"profitable growth"
		],
		"provider": "Motley Fool",
		"datepublished": "2023-05-09T15:00:00.000Z",
		"content": [
			"While there is still a lot of uncertainty in the near term with respect to the markets, investors who have at least 10 years to invest have an enormous advantage at building wealth compared to traders on Wall Street. McDonald's (NYSE: MCD) and Starbucks (NASDAQ: SBUX) are two examples of how just regularly putting money into shares of the top consumer brands can go a long way toward growing your savings for retirement. McDonald's has thousands of restaurants spread across 100 countries."
		]
	},
	{
		"title": "Dow Jones Stumbles As Fed Governors Assess Inflation, Looming Debt Default, Credit Crunch; AI Play Surges On Earnings",
		"keyword": [
			"Dow Jones",
			"Palo Alto Networks",
			"CPI inflation",
			"PayPal",
			"Innovator IBD 50 ETF"
		],
		"provider": "Investor's Business Daily",
		"datepublished": "2023-05-09T17:32:02.000Z",
		"content": [
			"Casino giant Wynn Resorts reports after the close, with expectations for a break-even first quarter."
		]
	},
	{
		"title": "The Home Depot Foundation and Rebuilding Together New Orleans Partner To Repair and Upgrade Home of New Orleans Army Veteran",
		"keyword": [
			"Home Depot",
			"Nedra Wilson",
			"Rebuilding Together New Orleans",
			"Team Depot",
			"military veteran"
		],
		"provider": "ACCESSWIRE",
		"datepublished": "2023-05-09T14:45:00.000Z",
		"content": [
			"<strong>NORTHAMPTON, MA / ACCESSWIRE / May 9, 2023 / </strong>The Home Depot:",
			"<a class=\"link\" data-ylk=\"slk:Originally published on Built From Scratch;elm:context_link;itc:0\" href=\"https://pr.report/MiTG1W5Y\" rel=\"nofollow noopener\" target=\"_blank\">Originally published on Built From Scratch</a>",
			"Nedra Wilson is a military veteran who served eight years in the U.S. Army. She has lived in her New Orleans home for more than 20 years. After Hurricane Katrina, she was forced to renovate the property, and it was damaged again during Hurricane Ida in 2021.",
			"Living on a fixed income, Nedra doesn't have the resources to complete all the necessary repairs. The Home Depot Foundation recently partnered with Rebuilding Together New Orleans (<a class=\"link\" data-ylk=\"slk:RTNO;elm:context_link;itc:0\" href=\"https://pr.report/DdB62C-G\" rel=\"nofollow noopener\" target=\"_blank\">RTNO</a>) to renovate and upgrade the home for Nedra and her 7-year-old grandchild.",
			"RTNO installed a new, fortified roof on the home. Team Depot, The Home Depot's associate volunteer force, joined in to help make the property safer and more accessible. Volunteers cleared debris from the property, weatherproofed her deck, removed and replaced the old insulation, and fixed the fence. They also added grab bars and accessibility items and landscaped the yard.",
			"Founded in 1988, RTNO's goal is to improve the quality of life of low-income homeowners, particularly those who are elderly, disabled, veterans or a single head of household with minor children. As The Home Depot Foundation celebrates <a class=\"link\" data-ylk=\"slk:30 years of giving back;elm:context_link;itc:0\" href=\"https://pr.report/7B9PQfUe\" rel=\"nofollow noopener\" target=\"_blank\">30 years of giving back</a>, Team Depot and Rebuilding Together volunteers are partnering to complete community service projects across the country for veteran homeowners like Nedra.",
			"Since 2011, The Home Depot Foundation has invested $475 million in veteran causes and helped renovate and enhance more than 55,000 veteran homes and facilities, ensuring more of our nation's heroes have a safe, comfortable place to call home that fits their individual needs.",
			"To learn more about Team Depot and The Foundation's commitment to serving veterans, visit <a class=\"link\" data-ylk=\"slk:HomeDepotFoundation.org;elm:context_link;itc:0\" href=\"https://pr.report/XSN0fO7M\" rel=\"nofollow noopener\" target=\"_blank\">HomeDepotFoundation.org</a>.",
			"Keep up with all the latest Home Depot news! <a class=\"link\" data-ylk=\"slk:Subscribe;elm:context_link;itc:0\" href=\"https://pr.report/3g87DHt1\" rel=\"nofollow noopener\" target=\"_blank\">Subscribe</a> to our bi-weekly news update and get the top Built from Scratch stories delivered straight to your inbox.",
			"<a class=\"link\" data-ylk=\"slk:View additional multimedia and more ESG storytelling from The Home Depot on 3blmedia.com;elm:context_link;itc:0\" href=\"https://pr.report/EHpCnOlQ\" rel=\"nofollow noopener\" target=\"_blank\">View additional multimedia and more ESG storytelling from The Home Depot on 3blmedia.com</a>",
			"<strong>Contact Info:</strong>",
			"Spokesperson: The Home Depot<br/>Website: <a class=\"link\" data-ylk=\"slk:https://www.3blmedia.com/profiles/home-depot;elm:context_link;itc:0\" href=\"https://pr.report/rGOC0p2y\" rel=\"nofollow noopener\" target=\"_blank\">https://www.3blmedia.com/profiles/home-depot</a><br/>Email: <a class=\"link\" data-ylk=\"slk:info@3blmedia.com;elm:context_link;itc:0\" href=\"mailto:info@3blmedia.com\">info@3blmedia.com</a>",
			"<strong>SOURCE: </strong>The Home Depot",
			"<br/><br/>View source version on accesswire.com: <br/><a class=\"link\" data-ylk=\"slk:https://www.accesswire.com/753729/The-Home-Depot-Foundation-and-Rebuilding-Together-New-Orleans-Partner-To-Repair-and-Upgrade-Home-of-New-Orleans-Army-Veteran;elm:context_link;itc:0\" href=\"https://www.accesswire.com/753729/The-Home-Depot-Foundation-and-Rebuilding-Together-New-Orleans-Partner-To-Repair-and-Upgrade-Home-of-New-Orleans-Army-Veteran\" rel=\"nofollow noopener\" target=\"_blank\">https://www.accesswire.com/753729/The-Home-Depot-Foundation-and-Rebuilding-Together-New-Orleans-Partner-To-Repair-and-Upgrade-Home-of-New-Orleans-Army-Veteran</a><br/><br/>"
		]
	},
	{
		"title": "Investing Advice From Warren Buffett, and 2 Magnificent Growth Stocks to Buy Now",
		"keyword": [
			"Warren Buffett",
			"MercadoLibre",
			"human capital management",
			"Paycom Software",
			"payroll errors",
			"HCM",
			"Latin America",
			"international businesses",
			"Paycom",
			"solid financial results"
		],
		"provider": "Motley Fool",
		"datepublished": "2023-05-09T14:05:00.000Z",
		"content": [
			"Warren Buffett recommends a buy-and-hold investment strategy, and these growth stocks are worth buying right now."
		]
	},
	{
		"title": "Is It Too Late to Buy Crocs Stock?",
		"keyword": [
			"Crocs stock",
			"Crocs",
			"revenue growth",
			"demand trends",
			"profitability"
		],
		"provider": "Motley Fool",
		"datepublished": "2023-05-09T13:45:00.000Z",
		"content": [
			"Investors sent Crocs (NASDAQ: CROX) shares lower in the immediate wake of the company's Q1 earnings report. Crocs' Q1 update contained lots of good news about the business. The addition of the Hey Dude franchise lifted overall revenue growth to a blazing 36% after accounting for currency-exchange rate shifts."
		]
	},
	{
		"title": "UPDATE 1-GM hires former Apple executive Abbott to lead software unit",
		"keyword": [
			"Apple Inc",
			"Mike Abbott",
			"General Motors Co",
			"Ford Motor Co",
			"software technologies",
			"industry background"
		],
		"provider": "Reuters",
		"datepublished": "2023-05-09T13:44:04.000Z",
		"content": [
			"(Adds CEO quote in paragraph 4, background on Abbott in paragraph 6, industry background in paragraphs 3 and 7)",
			"May 9 (Reuters) - General Motors Co on Tuesday named former Apple Inc executive Mike Abbott to lead a division that will bring together three software functions within the company.",
			"Abbott, whose appointment is effective from May 22, will spearhead development of vehicle and enterprise software technologies.",
			"Automakers, including GM and Ford Motor Co, have been increasingly ramping up their investment on technology and software services amid an electric-vehicle push, as they look to cash in on subscription-based services.",
			"\"We have entered the next phase of our technology driven transformation focused on rapidly scaling new EV models,\" GM's CEO Mary Barra said.",
			"At Apple, Abbott led a team responsible for the development of core infrastructure for all of the company's cloud-based services including iCloud, iMessage, Private Relay, Mail and account security.",
			"Bloomberg News had in March reported Abbott would step down from his role at the iPhone maker. He previously held top roles at Twitter and Palm, and was a partner at venture capital firm Kleiner Perkins.",
			"GM's announcement comes nearly two years after Detroit-based peer Ford appointed the head of Apple's car project, Doug Field, to lead its advanced technology and embedded systems efforts.",
			"(Reporting by Nathan Gomes in Bengaluru, additional reporting by Joseph White in Detroit; Editing by Krishna Chandra Eluri)"
		]
	},
	{
		"title": "3 Amazon Prime Traps to Avoid at All Costs",
		"keyword": [
			"Amazon Prime",
			"Prime membership",
			"Prime member",
			"Netflix"
		],
		"provider": "Motley Fool",
		"datepublished": "2023-05-09T13:30:13.000Z",
		"content": [
			"Amazon Prime costs $14.99 a month, but if you're willing to pay for a year of it at a time, you'll spend $139 instead. It's not a great thing to pay for a service you don't get good use out of, whether it's Netflix, a gym membership, or a monthly beauty box subscription. What you don't want to do is force yourself to place orders on Amazon for the express purpose of using your membership."
		]
	},
	{
		"title": "12 Best Fast Growth Stocks to Buy Now",
		"keyword": [
			"hedge funds",
			"growth stocks",
			"Arcturus Therapeutics Holdings Inc.",
			"hedge funds",
			"T. Rowe Price",
			"growth investing",
			"Cloudflare, Inc.",
			"Insider Monkey",
			"growth stocks",
			"Hedge Fund"
		],
		"provider": "Insider Monkey",
		"datepublished": "2023-05-09T13:29:27.000Z",
		"content": [
			"In this article, we will take a look at the 12 best fast growth stocks to buy now. To see more such companies, go directly to <a class=\"link\" data-ylk=\"slk:5 Best Fast Growth Stocks to Buy Now;elm:context_link;itc:0\" href=\"https://www.insidermonkey.com/blog/5-best-fast-growth-stocks-to-buy-now-4-1144187/\" rel=\"nofollow noopener\" target=\"_blank\"><strong>5 Best Fast Growth Stocks to Buy Now</strong></a>.",
			"Growth stocks were hammered in 2022 as inflation started to spike and the Federal Reserve began to increase interest rates. While 2023 provided no relief to investors and the market remains uncertain, some believe now is the time to pile into growth stocks for long-term gains. In February, JPMorgan’s Mislav Matejka said that value stocks might not maintain their momentum in 2023 and recommended investors to consider piling into growth stocks.",
			"According to Bloomberg, Matejka recommended investors to be “outright underweight value versus growth” since the analyst believed at the time that in the second half of 2023 the market will be “moving back to the recession trade, but even if the opposite scenario gains traction, value might not be the best place to be.”",
			"In November 2022, T. Rowe Price published a comprehensive report on growth investing titled “<a class=\"link\" data-ylk=\"slk:Navigating a Tough Environment for Growth Stocks;elm:context_link;itc:0\" href=\"https://www.troweprice.com/content/dam/trp-ecl/global/en/ipc/assets/us-retail-intermediary/2022/november/navigating-a-tough-environment-for-growth-stocks-id0005384/Navigating-a-Tough-Environment-for-Growth-Stocks.pdf\" rel=\"nofollow noopener\" target=\"_blank\">Navigating a Tough Environment for Growth Stocks</a>.” The report said that growth stocks could begin to rebound when inflation starts to ease. The firm believes growth companies working on solid products have a lot of room to run.",
			"The T. Rowe Price report talked about the transition of companies from on-premise data centers to Cloud platforms over the past few years to explain the importance of spotting growth opportunities in the market. The report said that the penetration of Cloud platforms is still in its early stages. This huge opportunity in the industry gave a boost to several growth stocks that were operating in the space.",
			"The report also discussed the concentrated nature of US stock indexes and the importance of looking beyond major growth stocks like Amazon, Alphabet, Microsoft and Meta Platforms.",
			"T. Rowe Price mentioned the following factors it believes are important in growth investing:",
			"Before the Fed's May meeting, investors were in a wait-and-see more. But even after the lates rate hike, the situation is not clear as the labor market in the US remains strong.",
			"The signs in early April were strong. But fast forward to May, the is still uncertainty around a lot of market factors. Still, growth stocks with solid catalysts remain a top choice for prudent investors and hedge funds. According to a <a class=\"link\" data-ylk=\"slk:Wall Street Journal;elm:context_link;itc:0\" href=\"https://www.wsj.com/articles/global-stocks-markets-dow-update-04-13-2023-7227fc32\" rel=\"nofollow noopener\" target=\"_blank\">Wall Street Journal</a> report in April<a class=\"link\" data-ylk=\"slk:,;elm:context_link;itc:0\" href=\"https://www.wsj.com/articles/global-stocks-markets-dow-update-04-13-2023-7227fc32\" rel=\"nofollow noopener\" target=\"_blank\">,</a> Stephen Lee, founding principal at Logan Capital Management, said he was mulling buying “growthier stock names in the consumer discretionary and industrial tech areas.”",
			"Pixabay/Public Domain",
			"<em><strong>Our Methodology</strong></em>",
			"For this article we used a stock screener to find stocks which have posted over 30% in sales growth over the past five years and over 30% sales growth quarter over quarter as of April 28. From this long list of stocks we picked growth stocks with the highest number of hedge fund investors. These are the best fast growth stocks to buy according to hedge funds. We gauged hedge fund sentiment from Insider Monkey’s database of 943 hedge. Some notable names in the list include Uber Technologies, Inc. (NYSE:UBER), Tesla, Inc. (NASDAQ:TSLA) and Booking Holdings Inc. (NASDAQ:BKNG).",
			"<strong><em>Number of Hedge Fund Holders: 9</em></strong>",
			"RNA medicines biotech firm Arcturus Therapeutics Holdings Inc. (NASDAQ:ARCT) shares have gained over 50% in 2023 through April 27. It is one of the best fast growth stocks to buy.  Arcturus Therapeutics Holdings Inc. (NASDAQ:ARCT)’s revenue in the fourth quarter of 2022 increased by a whopping 2663% year over year to reach $160.29 million, beating estimates by $79.77 million.",
			"As of the end of the fourth quarter of 2022, 9 hedge funds tracked by Insider Monkey had stakes in Arcturus Therapeutics Holdings Inc. (NASDAQ:ARCT). The biggest hedge fund stakeholder of Arcturus Therapeutics Holdings Inc. (NASDAQ:ARCT) was ARK Investment Management of Catherine D. Wood which owns a $34 million stake in the company.",
			"Like Uber Technologies, Inc. (NYSE:UBER), Tesla, Inc. (NASDAQ:TSLA) and Booking Holdings Inc. (NASDAQ:BKNG), ARCT is one of the best growth stocks to buy according to hedge funds.",
			"<strong><em>Number of Hedge Fund Holders: 15</em></strong>",
			"BeiGene, Ltd. (NASDAQ:BGNE) is a biotech company focused on making cancer treatments. In February BeiGene, Ltd. (NASDAQ:BGNE) posted its Q4 results. Revenue in the quarter increased by about 77% year over year to $380.1 million. However the metric missed the consensus estimate by $8.07 million.",
			"15 hedge funds out of the 943 funds tracked by Insider Monkey were long BeiGene, Ltd. (NASDAQ:BGNE) as of the end of the fourth quarter of 2022. The biggest hedge fund stakeholder of BeiGene, Ltd. (NASDAQ:BGNE) was Baker Bros. Advisors of Julian Baker and Felix Baker which owns a $2.6 billion stake in the company.",
			"<strong><em>Number of Hedge Fund Holders: 24</em></strong>",
			"Biotech firm Zymeworks Inc. (NYSE:ZYME) in the fourth quarter of 2022 saw a 1925% increase in its revenue on a YoY basis. GAAP EPS in the period came in at $4.65, beating estimates by $2.16. Net income in the quarter came in at $309.4 million, easily beating estimates.",
			"A total of 24 hedge funds tracked by Insider Monkey have stakes in Zymeworks Inc. (NYSE:ZYME). The total worth of these stakes is $287 million.",
			"<strong><em>Number of Hedge Fund Holders: 40</em></strong>",
			"Cloudflare, Inc. (NYSE:NET) saw a 41.9% year-over-year increase in revenue during the fourth quarter of 2022. Cloudflare, Inc. (NYSE:NET) ’s adjusted EPS in the period came in at $0.06, beating estimates by $0.01.",
			"Cloudflare, Inc. (NYSE:NET) is seeing a huge demand for its services from small and large companies. It was recently reported that Cloudflare, Inc. (NYSE:NET)’s services are used by ChatGPT. Cloudflare, Inc. (NYSE:NET) management, without naming OpenAI, said during a <a class=\"link yahoo-link\" data-ylk=\"slk:latest earnings call;elm:context_link;itc:0;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/cloudflare-inc-nyse-net-q4-033423182.html\">latest earnings call</a>:",
			"As of the end of the fourth quarter of 2022, 40 hedge funds had stakes in Cloudflare, Inc. (NYSE:NET). The biggest stakeholder of Cloudflare, Inc. (NYSE:NET) was Paul Marshall and Ian Wace’s Marshall Wace LLP which owns an $120 million stake in the company.",
			"Here is what Baron Funds specifically said about Cloudflare, Inc. (NYSE:NET) in its Q3 2022 investor <a class=\"link\" data-ylk=\"slk:letter;elm:context_link;itc:0\" href=\"https://www.insidermonkey.com/blog/should-you-invest-in-cloudflare-net-for-long-term-1082530/\" rel=\"nofollow noopener\" target=\"_blank\">letter</a>:",
			"<strong><em>Number of Hedge Fund Holders: 42</em></strong>",
			"Cloud security company Zscaler, Inc. (NASDAQ:ZS) in March posted its fiscal second quarter results, according to which the company’s revenue in the period increased by about 51.7% year over year to total $387.6 million, beating estimates by $22.82 million. For the third quarter Zscaler, Inc. (NASDAQ:ZS) expects revenue to come between $396 million to $398 million.",
			"A total of 42 hedge funds tracked by Insider Monkey had stakes in Zscaler, Inc. (NASDAQ:ZS) as of the end of the fourth quarter of 2022. The total worth of these stakes was $540 million. The most notable hedge fund stakeholder of Zscaler, Inc. (NASDAQ:ZS) was John Overdeck and David Siegel’s Two Sigma Advisors which owns an $81 million stake in the company.",
			"Artisan Global Discovery Fund made the following comment about Zscaler, Inc. (NASDAQ:ZS) in its Q4 2022 investor <a class=\"link\" data-ylk=\"slk:letter;elm:context_link;itc:0\" href=\"https://www.insidermonkey.com/blog/does-zscaler-zs-have-an-attractive-long-term-outlook-1123360/\" rel=\"nofollow noopener\" target=\"_blank\">letter</a>:",
			"<strong><em>Number of Hedge Fund Holders: 57</em></strong>",
			"PDD Holdings Inc. (NASDAQ:PDD) ranks 7th in our list of the fast growth stocks to buy now according to hedge funds. In March, PDD Holdings Inc. (NASDAQ:PDD) posted its Q4 of 2022 results. Revenue in the period increased by 46% year over year to reach $5.77 billion. However, the figure missed estimates by $140 million.",
			"Hedge fund sentiment remains strong for PDD Holdings Inc. (NASDAQ:PDD). Out of the 943 hedge funds tracked by Insider Monkey, 57 hedge funds reported owning stakes in the Chinese online retailer, up from 54 funds in the previous quarter. The most significant shareholder of PDD Holdings Inc. (NASDAQ:PDD) was <a class=\"link\" data-ylk=\"slk:D E Shaw;elm:context_link;itc:0\" href=\"https://www.insidermonkey.com/hedge-fund/d+e+shaw/228/\" rel=\"nofollow noopener\" target=\"_blank\"><strong>D E Shaw</strong></a> which owns a $468 million stake in the company.",
			"<strong><em>Number of Hedge Fund Holders: 63</em></strong>",
			"Enphase Energy, Inc. (NASDAQ:ENPH) last month posted first quarter of 2023 results. Adjusted EPS in the period came in at $1.37, beating estimates by $0.15. Revenue in the quarter jumped $726.02 million, beating estimates by $5.51 million.",
			"Piper Sandler recently upgraded Enphase Energy, Inc. (NASDAQ:ENPH) to Overweight from Neutral with a $255 price target. The firm cited the potential for meaningful upward earnings revisions in 2023-24 on margins.",
			"Like Uber Technologies, Inc. (NYSE:UBER), Tesla, Inc. (NASDAQ:TSLA) and Booking Holdings Inc. (NASDAQ:BKNG), Enphase Energy, Inc. (NASDAQ:ENPH)  is one of the favorite growth stocks of hedge funds. ClearBridge Investments made the following comment about Enphase Energy, Inc. (NASDAQ:ENPH) in its Q3 2022 investor <a class=\"link\" data-ylk=\"slk:letter;elm:context_link;itc:0\" href=\"https://www.insidermonkey.com/blog/multiple-tailwinds-drove-enphase-energy-enph-to-outperform-in-the-third-quarter-1089661/\" rel=\"nofollow noopener\" target=\"_blank\">letter</a>:",
			"<b>Click to continue reading and see <a class=\"link\" data-ylk=\"slk:5 Best Fast Growth Stocks to Buy Now;elm:context_link;itc:0\" href=\"https://www.insidermonkey.com/blog/5-best-fast-growth-stocks-to-buy-now-4-1144187/\" rel=\"nofollow noopener\" target=\"_blank\"><strong>5 Best Fast Growth Stocks to Buy Now</strong></a>.</b> ",
			"Suggested articles:",
			"Disclosure: None. <strong>12 Best Fast Growth Stocks to Buy Now</strong><strong> </strong>is originally published on Insider Monkey."
		]
	}
]