[
	{
		"title": "Disney earnings: Q2 ‘will be generally positive,’ analyst says",
		"keyword": [
			"Rick Munarriz",
			"Motley Fool"
		],
		"provider": "Yahoo Finance Video",
		"datepublished": "2023-05-09T15:50:00.000Z",
		"content": [
			"The Motley Fool Senior Analyst Tech &amp; Media Rick Munarriz joins Yahoo Finance Live to discuss the expectations for Disney’s second-quarter earnings, CEO Bob Iger’s financial turnaround plan for the company, and the outlook for Disney+.",
			"<span class=\"speaker\">-</span> All right. Well, let's take another look at Disney's attempts to prove itself this quarter. Whiz bang showings from movies like \"Ant-Man and \"Guardians Volume 3\" might draw back moviegoers and revenues. But streaming is the future. And its attempts to capture that market have continued to bleed money. In the balance, Disney CEO, Bob Iger, hoping to continue his financial turnaround of the company.",
			"Joining us with more, Rick Munarriz, the Motley Fool Senior Analyst for Tech and Media. Good to see you here, Rick. So I first want to get your expectations here because there's a lot of different parts of the business here. You have the parks, the studios, Disney Plus, and then its linear TV business. How much is at stake for these different parts of the business, this earnings call?",
			"<span class=\"speaker\">RICK MUNARRIZ:</span> There's a lot. And the sum of everything, obviously this will probably be the third consecutive quarter of year-over-year growth in the high single digits, which is OK. But it's really a matter of extreme, sort of what Ali was pointing out, that the theme parks are basically hitting it out of the parks, so to speak.",
			"The DirecTV, the Disney Plus, Hulu, that direct-to-consumer streaming business is also coming through with double-digit growth. But you also have the legacy, the linear networks, the old school media businesses that are struggling. They're struggling to keep consumers, as many of them are shifting to the streaming services that Disney is also offering.",
			"But you also have advertisers that are saying, well, hey, if people aren't watching linear television, I'm not going to pay as much to reach them as I would through digital channels and other outlets, which is where they're changing their marketing budgets, too. So a lot of highs and lows will probably get in tomorrow's report. At the end of the day, it'll be a quarter of decent top-line growth, questionable bottom-line performance.",
			"But, hopefully, Bob Iger-- again, six months into his tenure, has the right recipe to keep this positive optimism for a stock that's beating the market this year, something it hasn't done since 2020. So clearly a stock that has been hit hard over the last two years.",
			"<span class=\"speaker\">-</span> Indeed, I mean-- and as we break some of this down, looking at the movie studio business, expected to hold up better than a year ago. Obviously kicking off this summer blockbuster season. How key is that going to be to the rest of Disney's business?",
			"<span class=\"speaker\">RICK MUNARRIZ:</span> Yeah, so again, Disney is that perfect ecosystem where a big movie, and sometimes even a big theme park ride, or a big television show, it could the \"Mandalorian.\" It could be \"The Haunted Mansion\" as the ride, which is getting another movie later this year.",
			"And, obviously, the Marvel and the Lucasfilm franchises, the Pixar franchises, if you have a hit movie, that creates opportunities for rides in the theme parks, TV shows on streaming services like Disney, and Disney Channel, and Disney Junior, all those outlets, and obviously consumer products. It's hard to find a home that doesn't have some Disney consumer product if you have a young family.",
			"<span class=\"speaker\">-</span> This is true. Definitely a lot of merch to be had there. And then, of course, on the flip side of that, you have their legacy linear business here. Obviously, a lot of people still continuing to pull the plug when it comes to what-- not wanting that but not necessarily going to Disney. Talk about what they need to do to really sort of pick up on that ecosystem and perhaps make more of this. What are you hoping to hear on the call?",
			"<span class=\"speaker\">RICK MUNARRIZ:</span> Yeah, I'm hoping to hear-- just as Ali said --that the analysts were expecting an improvement in, basically, the direct-to-consumer, which is basically the Disney Plus helm business to be doing better than it was the last two quarters of fiscal 2024-- I'm sorry, fiscal 2023 --is more than $4 billion in operating loss on the streaming business. So clearly you want to see improvements in that.",
			"Bob Iger has made it clear earlier this year, he said he's earmarking $5.5 billion in annual cost savings. And while Ali did mention some of the layoffs, three billion of that-- so the lion's share of that $5.5 billion --will come in content cost. And that's always a delicate balance is, can you raise prices the way they did in December with their ad-free version of Disney Plus, and Hulu, and ESPN Plus before that, without sacrificing the fact that you're not spending as much in content?",
			"So will consumers be upset or will they continue to pay? That's the big question heading into it. And we'll get some color now. But I'm really hoping that we get more perspective of how things go in the next few quarters. Bob Iger, again, he is on a two-year contract. And we're already six months in it. This is a very short wick. And right now it feels like scented candles.",
			"But as we get closer to fiscal 2024, it may feel more like a stick of dynamite if Disney Plus isn't cash flow positive, as he's been hoping to get or if there's not a successor strategy that the market can get behind. A lot of question marks Disney will have heading into next year.",
			"But I think tomorrow's earnings report will be generally positive. We saw this morning, SeaWorld Entertainment is up 5%, better than expected revenue. Yesterday, Six Flags Entertainment, even though it's a completely different company, kind of regional scope with their gated attractions, up 19% yesterday, better than expected revenue.",
			"Comcast two weeks ago, which runs the Universal Studios theme parks pretty much right around where Disney is located in Central Florida and Southern California, had strong revenues there, too, 25% revenue growth for their theme park segment. So the climate-- the soil is fertile for a strong report.",
			"But investors really want to hear how the bottom line is going to come out. And that's something that that's the real wildcard with Disney, especially in this transition where there's a clear commitment to cut costs and a short time to get it done.",
			"<span class=\"speaker\">-</span> Indeed, I mean, it used to be the case with streaming that content was king. A lot more strategic now, especially when you think about ad spend. And then when you add into the fact that with theme parks you have consumers tightening their wallets but they do seem to still be wanting these annual Disney passes, as well.",
			"In terms of forward guidance, then, what do you think we'll expect to hear perhaps about the macroeconomic conditions and whether the consumer will still be as strong?",
			"<span class=\"speaker\">RICK MUNARRIZ:</span> Yeah, so Disney hasn't always been very open-minded forward with its guidance looking ahead. They provide some general framework. But for the most part, they're not going to give hard and cold numbers. It's mostly we're going by what analysts estimate from what they're hearing from Disney.",
			"But, yeah, you do-- again, a company that's going to be cutting $5.5 billion started earlier this year through the end of the fiscal year 2024, which ends in September of next year. So you basically have a year and a half left to make these cuts. You want to see progress.",
			"We saw some layoffs, mostly in the creative division on the studio end. But we want to see as consumers and as shareholders, we want to see that these cost cuts are actually bleeding down to the bottom line. It's not just pain for the people being let go or pain for the park enthusiasts that are paying more for a day at Disney World or Disneyland.",
			"So we want to see progress. And we want to make sure it's worth it that consumers are doing it. But, yeah, of course, we get to the point where pricing elasticity does not go forever.",
			"We're in an environment where a lot of people are paying up escapism, as far as the theme parks, as far as movies, as far as watching TV, a sci-fi series on Disney Plus. All these things provide the escapism that people don't mind paying for now. But, again, for a stock that is basically half the price of where it was two years ago, clearly there's a long way to go before Disney truly wins everyone over. It just feels good right now. But it definitely can feel better.",
			"<span class=\"speaker\">-</span> All right, we'll have to leave it there. But we're looking forward to tracking that and the call as well. Rick Munarriz, the Motley Fool's senior analyst for tech and media. Thank you so much."
		]
	},
	{
		"title": "Disney selling Hulu would be a 'grave mistake': Analyst",
		"keyword": [
			"Walt Disney Company",
			"Hulu",
			"Disney",
			"Seana Smith"
		],
		"provider": "Yahoo Finance Video",
		"datepublished": "2023-05-08T22:01:32.000Z",
		"content": [
			"The Walt Disney Company (<a class=\"link\" data-i13n=\"cpos:1;pos:1\" data-ylk=\"slk:DIS;cpos:1;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/quote/DIS?fr=sycsrp_catchall\">DIS</a>) is set to release its fiscal second quarter earnings after the closing bell on Wednesday. Revenue is expected to come in at $21.8 billion dollars, with adjusted earnings per share of $0.93.",
			"The media giant is projected to report strong earnings growth on its direct-to-consumer offerings.",
			"Yahoo Finance's <a class=\"link\" data-i13n=\"cpos:2;pos:1\" data-ylk=\"slk:Seana Smith;cpos:2;pos:1;elm:context_link;itc:0\" href=\"https://www.yahoo.com/author/seana-smith\">Seana Smith</a> and <a class=\"link\" data-i13n=\"cpos:3;pos:1\" data-ylk=\"slk:Akiko Fujita;cpos:3;pos:1;elm:context_link;itc:0\" href=\"https://www.yahoo.com/author/akiko-fujita\">Akiko Fujita</a> interviewed Jason Bazinet, Citi Managing Director, on what investors should expect this quarter.",
			"Bazinet believes <a class=\"link yahoo-link\" data-i13n=\"cpos:4;pos:1\" data-ylk=\"slk:a potential Hulu sale;cpos:4;pos:1;elm:context_link;itc:0;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/news/nbc-universal-disney-hulu-ownership-201240535.html?fr=sycsrp_catchall\">a potential Hulu sale</a> would be a \"grave mistake\" for Disney.",
			"Bazinet says he is in the \"minority among investors\" as he would like to see Disney buy the balance it doesn't own in order to merge with Disney+ and create what he calls a \"TV substitute on the streaming world.\"",
			"Disney currently owns two-thirds of Hulu with Comcast's (<a class=\"link\" data-i13n=\"cpos:5;pos:1\" data-ylk=\"slk:CMCSA;cpos:5;pos:1;elm:context_link;itc:0\" href=\"https://finance.yahoo.com/quote/CMCSA/\">CMCSA</a>) NBCUniversal controlling the rest.",
			"See the full interview <a class=\"link yahoo-link\" data-i13n=\"cpos:6;pos:1\" data-ylk=\"slk:here;cpos:6;pos:1;elm:context_link;itc:0;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\" href=\"https://finance.yahoo.com/video/disney-plain-vanilla-recession-fine-203909323.html\">here</a>.",
			"Key Video Takeaways:",
			"0:00:00 - What Wall Street is focused on",
			"0:01:14 - Hulu's future with Disney",
			"<span class=\"speaker\">AKIKO FUJITA:</span> All eyes are going to be on that direct-to-consumer business. What are you expecting on that number?",
			"<span class=\"speaker\">JASON BAZINET:</span> Well, just to frame it for you, remember, Disney lost about $4 billion in the streaming business last fiscal year. Their quarter-- their first fiscal quarter, they lost about $1 billion in the quarter. And so no real discernible improvement, right? A billion dollars in a loss times 4 is another 4 billion loss. So what the Street will be focused on is, hopefully, a sharp reduction in the direct-to-consumer losses. The company is [INAUDIBLE] to about $200 million of smaller losses. So call it 800 million. And I think that's what the Street will be focused on. If we end up with a much smaller loss, the shares, I think, will do quite well.",
			"<span class=\"speaker\">SEANA SMITH:</span> Jason, what do you think we're going to hear when it comes to Hulu? Lots of talk about what exactly that's going to look like here just in terms of its future with Disney, whether or not it could potentially sell its stake. How do you see Disney addressing Hulu down the road?",
			"<span class=\"speaker\">JASON BAZINET:</span> Look, I was flabbergasted on the last earnings call, right, which was Mr. Iger's first quarter back, when he said everything was on the table when it came to Hulu. He was uncomfortable with what he called \"general entertainment,\" which pointed towards a potential Hulu sale. I think that would be a grave mistake. We would like to see Disney buy in the balance of Hulu it doesn't own, merge that with Disney+, rationalize some costs and really create a-- what I'll call a TV substitute on the streaming world.",
			"But I will tell you, I'm in the minority among investors. Every investor I chat with would be thrilled if Disney sold Hulu. So I'm in the minority. But if anything that Mr. Iger does tomorrow or Disney does tomorrow that indicates that they're more open to selling it, the Street would applaud that. I think actually it would be a mistake. But again, I'm in the minority."
		]
	},
	{
		"title": "Google To Dole Out $100M To New York Times Under Multi-Year Content Deal",
		"keyword": [
			"Google",
			"Google News",
			"The New York Times",
			"Alphabet Inc"
		],
		"provider": "Benzinga",
		"datepublished": "2023-05-09T15:14:13.000Z",
		"content": [
			"Don't miss real-time alerts on your stocks - join <a class=\"link\" data-ylk=\"slk:Benzinga Pro;elm:context_link;itc:0\" href=\"https://pro.benzinga.com/\" rel=\"nofollow noopener\" target=\"_blank\">Benzinga Pro</a> for free! <a class=\"link\" data-ylk=\"slk:Try the tool that will help you invest smarter, faster, and better;elm:context_link;itc:0\" href=\"https://pro.benzinga.com/\" rel=\"nofollow noopener\" target=\"_blank\">Try the tool that will help you invest smarter, faster, and better</a>.",
			"This article <a class=\"link\" data-ylk=\"slk:Google To Dole Out $100M To New York Times Under Multi-Year Content Deal;elm:context_link;itc:0\" href=\"https://www.benzinga.com/news/23/05/32281165/google-to-dole-out-100m-to-new-york-times-under-multi-year-content-deal\" rel=\"nofollow noopener\" target=\"_blank\">Google To Dole Out $100M To New York Times Under Multi-Year Content Deal</a> originally appeared on <a class=\"link\" data-ylk=\"slk:Benzinga.com;elm:context_link;itc:0\" href=\"https://www.benzinga.com\" rel=\"nofollow noopener\" target=\"_blank\">Benzinga.com</a>",
			".",
			"<i>© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</i>"
		]
	},
	{
		"title": "Is Google Stock A Buy Amid Artificial Intelligence Battleground?",
		"keyword": [
			"Google",
			"internet search",
			"Google stock",
			"artificial intelligence",
			"Google developers",
			"Google Cloud Platform",
			"Google Maps",
			"Google",
			"advertising business"
		],
		"provider": "Investor's Business Daily",
		"datepublished": "2023-05-09T15:07:04.000Z",
		"content": [
			"Here's what a fundamental and technical analysis says about buying Google stock as its search advertising business holds up."
		]
	},
	{
		"title": "Verizon issues its fifth $1 billion green bond",
		"keyword": [
			"Verizon Communications Inc.",
			"green bond",
			"electrical grids",
			"green finance",
			"capital markets",
			"energy investments",
			"Wells Fargo Securities"
		],
		"provider": "GlobeNewswire",
		"datepublished": "2023-05-09T15:00:00.000Z",
		"content": [
			"<em>Company has issued five green bonds for a total of $5 billion since 2019</em>",
			"NEW YORK, May 09, 2023 (GLOBE NEWSWIRE) -- Today, Verizon Communications Inc. (NYSE, Nasdaq: VZ) settled its fifth green bond offering of $1 billion, with the net proceeds expected to be allocated entirely toward renewable energy investments to accelerate the transition to greener electrical grids across the U.S. This follows Verizon’s <a class=\"link\" data-ylk=\"slk:announcement;elm:context_link;itc:0\" href=\"https://www.globenewswire.com/Tracker?data=U2pkGhqlehS5G49MIVJuH68-3h7mXPLFd1aBbyjhfHVpdFumVo96_ZKXUpjBUDg_V9ijVNGMNxAMM17sZXrC0QjgbxsnEwuIPK39JbtO6-F5rlfFKGP9fYaeOm0OyFgqlI48k6HzaCtha_lzIuoWNJVE0Om4PBdGwBBLrThD7wA=\" rel=\"nofollow noopener\" target=\"_blank\"><u>announcement</u></a> in February that the company <a class=\"link\" data-ylk=\"slk:fully allocated the net proceeds of its fourth green bond;elm:context_link;itc:0\" href=\"https://www.globenewswire.com/Tracker?data=KutHbWbEzynEyTiBqK2PdvAN_Et3sLUlYNUPYQbghwPIg8c4ijsdSmbzm1OHx5wO3nwFlSDTiVBCLLjusqCm4HJwedbIvhDtVh52fj379tIM_p9hzQcLvMQLAhXVbmh7W-2VJRnPlkFo77BKXksy39pWvVxx1aPnaVP_LX4aot-qQaBJ7NLptdRgVdah8j4r\" rel=\"nofollow noopener\" target=\"_blank\"><u>fully allocated the net proceeds of its fourth green bond</u></a> to renewable energy investments. Verizon has now issued five green bonds for a total of $5 billion since 2019.<br/>",
			"“I believe our actions speak louder than our words, and I am proud of the steps Verizon has taken towards our ambitious environmental and social impact goals,” said Tony Skiadas, Verizon’s executive vice president and chief financial officer. “As one of the largest corporate green bond issuers in the U.S., and as a leader in green finance and diversity in the capital markets with our Green Financing Framework, we are proud that our actions are contributing to greener power grids across the nation.”",
			"In 2021, Verizon deepened its commitment to fostering diversity, equity and inclusion in economic opportunities in the capital markets by including a pledge in its<a class=\"link\" data-ylk=\"slk:Green Financing Framework;elm:context_link;itc:0\" href=\"https://www.globenewswire.com/Tracker?data=9zvvP5o1xeterf4W3bmvaEH588iqfuYUQehmkOJsNXXgmLdpM6wnxqNHsUSMoXedN5CcCe8pTg7eEC44QS8QQpc1Xkh1I4POBel_d3kz6Oles1fAgk3L3FRr26caZqfoCUCtH05xMCtAykgo9HJvqAhxH_2hmOY0wKbqEdRhweE=\" rel=\"nofollow noopener\" target=\"_blank\"> <u>Green Financing Framework</u></a> to only engage underwriters for its green bond transactions that have established clear and impactful commitments in support of the U.N. Sustainable Development Goals (SDGs) and/or are a diverse-owned firm or have a core mission of promoting diversity, equity and inclusion. Consistent with these criteria, the company is proud to partner with Wells Fargo Securities and four minority- and women-owned firms as lead underwriters for its fifth green bond: CastleOak Securities, L.P., Loop Capital Markets, Ramirez &amp; Co., Inc. and Siebert Williams Shank. The five firms shared equally in fees paid and responsibility for bringing this offering to the market.",
			"This capital market transaction aligns with Verizon’s long-standing commitment to drive both environmental and social progress as part of its responsible business plan,<a class=\"link\" data-ylk=\"slk:Citizen Verizon;elm:context_link;itc:0\" href=\"https://www.globenewswire.com/Tracker?data=rCOAHqMd-eKQCSCVVdq3eq-oDSCTSyxtN_LZwGOjBiDDrm0OzbQf7syTzpAGvQXZfcHPKMDAfqJqP33GHtRLpnGQ8rFePor8GvgYnA-j9MWQBlbLQZmj8djE7RnpGs7O\" rel=\"nofollow noopener\" target=\"_blank\"> <u>Citizen Verizon</u></a>, empowering the technology leader to deliver on its mission to move the world forward by addressing pressing societal issues.",
			"Verizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.",
			"VERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at <a class=\"link\" data-ylk=\"slk:verizon.com/news;elm:context_link;itc:0\" href=\"https://www.globenewswire.com/Tracker?data=tw19aF-MViYwIK3f2-AiO-cUu2Td_E83jHHI2fwncsMiW53TyLH4QtM0E_99NkllEixiNYfABvZnqcJMH5O0kIrLMuL2LOPm2zMcGm9y2a8=\" rel=\"nofollow noopener\" target=\"_blank\">verizon.com/news</a>. News releases are also available through an RSS feed. To subscribe, visit <a class=\"link\" data-ylk=\"slk:www.verizon.com/about/rss-feeds/;elm:context_link;itc:0\" href=\"https://www.globenewswire.com/Tracker?data=kr62fcyTzPpwzaavCZ5xyj2_egZOcCNRapAe1IJ6S4PVPmXi29dAI0zIbcWCz-GsU-BtQaSOCCpgCKtP_uxe_w6Kh3q9gX6WjD-z4mJfIcm3Hbqw7rOvxvA1fjcWKER8\" rel=\"nofollow noopener\" target=\"_blank\">www.verizon.com/about/rss-feeds/</a>.",
			"<strong>Media contact:<br/></strong>Eric Wilkens<br/>eric.wilkens@verizon.com<br/>201.572.9317<br/>@ericwilkens",
			"<br/>"
		]
	},
	{
		"title": "Bot or Not? Spotify Cracks Down on Boomy's Suspected Artificial Streaming Activity",
		"keyword": [
			"Boomy",
			"Spotify",
			"streaming services",
			"Lucian Grainge",
			"artificial intelligence"
		],
		"provider": "Benzinga",
		"datepublished": "2023-05-09T14:59:14.000Z",
		"content": [
			" ",
			"Don't miss real-time alerts on your stocks - join <a class=\"link\" data-ylk=\"slk:Benzinga Pro;elm:context_link;itc:0\" href=\"https://pro.benzinga.com/\" rel=\"nofollow noopener\" target=\"_blank\">Benzinga Pro</a> for free! <a class=\"link\" data-ylk=\"slk:Try the tool that will help you invest smarter, faster, and better;elm:context_link;itc:0\" href=\"https://pro.benzinga.com/\" rel=\"nofollow noopener\" target=\"_blank\">Try the tool that will help you invest smarter, faster, and better</a>.",
			"This article <a class=\"link\" data-ylk=\"slk:Bot or Not? Spotify Cracks Down on Boomy's Suspected Artificial Streaming Activity;elm:context_link;itc:0\" href=\"https://www.benzinga.com/news/23/05/32280970/bot-or-not-spotify-cracks-down-on-boomys-suspected-artificial-streaming-activity\" rel=\"nofollow noopener\" target=\"_blank\">Bot or Not? Spotify Cracks Down on Boomy's Suspected Artificial Streaming Activity</a> originally appeared on <a class=\"link\" data-ylk=\"slk:Benzinga.com;elm:context_link;itc:0\" href=\"https://www.benzinga.com\" rel=\"nofollow noopener\" target=\"_blank\">Benzinga.com</a>",
			".",
			"<i>© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.</i>"
		]
	},
	{
		"title": "Why AI Is a Game-Changer for the Music Industry",
		"keyword": [
			"artificial intelligence",
			"copyright management",
			"personalization",
			"artists",
			"content creation",
			"lyrical content",
			"music industry",
			"music lovers"
		],
		"provider": "Motley Fool",
		"datepublished": "2023-05-09T14:39:00.000Z",
		"content": [
			"Discover how artificial intelligence is transforming the music industry and creating new opportunities for artists, platforms, and listeners."
		]
	},
	{
		"title": "Alphabet Stock, Parent Of Google, Showing Rising Relative Strength",
		"keyword": [
			"Alphabet",
			"price strength",
			"relative price strength",
			"Relative Strength",
			"market leadership"
		],
		"provider": "Investor's Business Daily",
		"datepublished": "2023-05-09T14:36:00.000Z",
		"content": [
			"A Relative Strength Rating upgrade for Alphabet Cl A shows improving technical performance. Will it continue?"
		]
	},
	{
		"title": "Mark Zuckerberg Scores Unexpected Victory",
		"keyword": [
			"Mark Zuckerberg",
			"Meta Platforms",
			"Facebook",
			"billionaire",
			"crème de la crème",
			"Camarillo"
		],
		"provider": "TheStreet.com",
		"datepublished": "2023-05-09T14:36:00.000Z",
		"content": [
			"The CEO of social media giant Meta Platforms took to Brazilian jiu-jitsu during the covid-19 pandemic."
		]
	},
	{
		"title": "Disney World Is Making Things Easier While Its Top Rival Is Not",
		"keyword": [
			"Disney World",
			"Universal Orlando",
			"Comcast",
			"Walt Disney",
			"Disney Dining Plan",
			"theme park",
			"SeaWorld Entertainment",
			"Disney",
			"Disney cast members"
		],
		"provider": "Motley Fool",
		"datepublished": "2023-05-09T14:30:00.000Z",
		"content": [
			"Comcast's Universal Orlando is raising prices at the same time that Disney World and SeaWorld are raising the stakes."
		]
	}
]