[
	{
		"title": "Boeing receives order from Ryanair for up to 300 737-Max planes",
		"keyword": [
			"Boeing",
			"Rachelle Akuffo"
		],
		"provider": "Yahoo Finance Video",
		"datepublished": "2023-05-09T16:09:21.000Z",
		"content": [
			"Yahoo Finance Live’s Rachelle Akuffo breaks down Tuesday’s trending ticker, Boeing.",
			"<span class=\"speaker\">RACHELLE AKUFFO:</span> Time now for our trending ticker. We're looking at Ryanair's big bite from Boeing. The Irish budget air carrier inking a deal on Tuesday for at least 150 of Boeing's 737 MAX 10 planes, with the option to buy another 150. Now, the move puts a bridge over a long-running dispute over prices and delivery delays between Boeing and Ryanair. The airline is one of Boeing's largest customers, and runs a fleet that's exclusively made up of 737 models. Ryanair during negotiations aiming to maintain its reputation for rock-bottom rates by keeping its costs, including aircraft purchase prices, low."
		]
	},
	{
		"title": "Ryanair dismisses hydrogen-fuelled net zero flights as it places biggest ever order for Boeing jets",
		"keyword": [
			"Ryanair",
			"Boeing",
			"Dave Calhoun",
			"737 Max",
			"Michael O&#39;Leary",
			"hydrogen planes",
			"Neil Sorahan"
		],
		"provider": "The Telegraph",
		"datepublished": "2023-05-09T16:41:00.000Z",
		"content": [
			"Ryanair has unveiled its biggest-ever aircraft order as one of its top executives said the switch to hydrogen or electric powered planes will not happen “in my lifetime”.",
			"The budget carrier has agreed a $40bn (£31.7bn) deal with Boeing to buy 150 of <a class=\"link\" data-ylk=\"slk:the manufacturer’s 737 Max 10 jets;elm:context_link;itc:0\" href=\"https://www.telegraph.co.uk/business/2023/04/14/boeing-manufacturing-delays-flagship-737-max/\" rel=\"nofollow noopener\" target=\"_blank\">the manufacturer’s 737 Max 10 jets</a> with an option for a further 150.",
			"The planes will be delivered by Boeing to Ryanair between 2027 and 2034 and be powered by conventional aircraft engines.",
			"Neil Sorahan, Ryanair’s finance chief, who was in Washington to sign the landmark deal with Boeing, said that the deal was a clear sign of what the future held for commercial aviation.",
			"The 51-year-old said: “They [hydrogen or electric powered planes] may be the future. But I’m not sure they will get there in my lifetime,” he said, before likening hydrogen jets to space rockets that carry a handful of passengers with huge tanks of fuel.",
			"Unlike sustainable aviation fuel, made from used cooking oils and other waste, hydrogen was not a “drop-in solution” and would require “massive investment in the infrastructure”, he added.",
			"“So I’m afraid it ain’t going to get there,” Mr Sorahan said. “Batteries don’t have the capacity at this stage to get the range that is needed.”",
			"Bosses at Ryanair hope that the new plane order will take the airline from carrying an estimated 225 million passengers in the year to March 2026 up to 300 million by 2034, at which point the carrier would have a fleet of 800 jets.",
			"Mr Sorahan’s remarks followed similar comments by <a class=\"link\" data-ylk=\"slk:Ryanair chief executive Michael O’Leary;elm:context_link;itc:0\" href=\"https://www.telegraph.co.uk/business/2023/04/19/delusional-brexiteers-will-die-soon-says-ryanair-chief/\" rel=\"nofollow noopener\" target=\"_blank\">Ryanair chief executive Michael O’Leary</a> in January. He said that hydrogen planes are “completely unfeasible” and electric-powered commercial aircraft would not become a reality by 2050.",
			"Mr O’Leary, who sat alongside Mr Sorahan and Boeing chief executive Dave Calhoun at the deal signing on Tuesday, appeared to have buried the hatchet after an 18-month row over Boeing plane prices.",
			"He said: “In our view it will never be cheap enough and in Boeing's view it is always far too cheap.”",
			"Mr Calhoun joked that no premium was high enough for Boeing's best-selling jet.",
			"The 230-seat 737 Max 10, the largest plane in the 737 Max range, has yet to be certified by regulators in the US and Europe.",
			"Its rollout has been overshadowed by two fatal crashes in October 2018 and March 2019, which led to all 737 Max aircraft being grounded between March 2019 and December 2020.",
			"The plane is now being cleared for use on a version-by-version basis. The Max 10 is expected to be certified next year.",
			"Relations between Ryanair and Boeing soured last year as the Irish airline became <a class=\"link\" data-ylk=\"slk:increasingly frustrated with delivery delays;elm:context_link;itc:0\" href=\"https://www.telegraph.co.uk/business/2023/04/14/ryanair-summer-holiday-flights-at-risk-boeing-737-max/\" rel=\"nofollow noopener\" target=\"_blank\">increasingly frustrated with delivery delays</a>.",
			"Mr O'Leary said that the relationship with Boeing was “a bit like a marriage... we have occasional rows and occasional splits and then we come together and then kiss and make up.”"
		]
	},
	{
		"title": "Boeing Stock Is Rising. Here Are 2 Reasons Why.",
		"keyword": [
			"Boeing"
		],
		"provider": "Barrons.com",
		"datepublished": "2023-05-09T16:05:00.000Z",
		"content": [
			"Ryanair orders a lot of MAX jets from Boeing, and the aerospace giant updates its delivery figures for 2023."
		]
	},
	{
		"title": "Ryanair unlikely to tap market this year to help finance Boeing jets",
		"keyword": [
			"Ryanair",
			"Boeing",
			"Neil Sorahan",
			"leasing market",
			"bond market"
		],
		"provider": "Reuters",
		"datepublished": "2023-05-09T15:09:27.000Z",
		"content": [
			"DUBLIN, May 9 (Reuters) - Ryanair is unlikely to tap the bond market this year to finance part of a new Boeing order unless there is a dip in such markets, finance chief Neil Sorahan said on Tuesday.",
			"The Irish airline on Tuesday agreed a multibillion-dollar deal for as many as 300 Boeing jets that it plans to fund substantially from internal cashflow, but said it would also remain opportunistic in its fleet financing strategy.",
			"\"We're unlikely (to tap the market this year) unless we're being hugely opportunistic and we see a dip in the bond or the leasing market. The working assumption for the current financial year is that we'll continue to pay down debt from our cash resources,\" Sorahan said. (Reporting by Padraic Halpin Editing by David Goodman)"
		]
	},
	{
		"title": "Boeing deliveries fall by half in April due to 737 MAX bracket defect",
		"keyword": [
			"Boeing",
			"Aircraft deliveries",
			"737 MAX"
		],
		"provider": "Reuters",
		"datepublished": "2023-05-09T15:02:36.000Z",
		"content": [
			"WASHINGTON (Reuters) - Boeing Co deliveries fell to 26 airplanes in April, less than half of the previous month's total, after a manufacturing defect forced the company to halt some shipments of its bestselling 737 MAX passenger jet.",
			"Deliveries of the MAX, which had climbed to 52 narrowbody jets in March, dropped to 17 planes last month.",
			"That left passenger jet deliveries for the U.S. planemaker at their lowest level since July 2022, as well as below the 35 planes delivered last April.",
			"Boeing booked 13 net orders after factoring in 21 cancelled orders, including a sale-leaseback deal for three MAXs for lessor BOC Aviation Ltd for planes originally ordered by Dominican Republic operator Arajet.",
			"In addition to the MAXs, Boeing also delivered six 787 Dreamliners, one 767 freighter, one 777 freighter and one 737-800 jet to its defense business to be converted into a P-8 Poseidon maritime patrol aircraft for South Korea.",
			"Aircraft deliveries are closely watched by Wall Street because planemakers are able to collect the majority of its money when they hand over jets to customers.",
			"The latest impediment to Boeing's deliveries involves two brackets that connect the MAX's aft fuselage with its vertical tail that were incorrectly installed by fuselage maker Spirit AeroSystems Holdings Inc.",
			"Boeing estimates that about 75% of the 225 MAXs in its inventory have brackets that will need to be reinstalled before customers can take possession of the jets.",
			"Boeing Chief Financial Officer Brian West told investors in an earnings call last month that MAX deliveries would slow through the second quarter, but then grow to about 40 jets per month, with sequential quarterly improvement in the second half.",
			"Boeing has delivered 156 jets over the first four months of 2023, including 128 MAXs. Rival Airbus SE has not yet released its April order and delivery statistics.",
			"(Reporting by Valerie Insinna in Washington; Editing by Jamie Freed)"
		]
	},
	{
		"title": "3M Annual Meeting Highlights Business Portfolio, Innovation, and Actions to Drive Future Performance",
		"keyword": [
			"3M",
			"chairman of the board",
			"Ford Motor Company"
		],
		"provider": "PR Newswire",
		"datepublished": "2023-05-09T14:40:00.000Z",
		"content": [
			"<span class=\"legendSpanClass\"><span class=\"xn-location\">ST. PAUL, Minn.</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">May 9, 2023</span></span> /PRNewswire/ -- At today's Annual Meeting of Shareholders, <span class=\"xn-money\">3M</span> (NYSE:MMM) highlighted its strong portfolio of leading businesses, leading innovation in material science, and significant actions taken to drive performance for shareholders and customers in a dynamic environment.",
			"\"<span class=\"xn-money\">3M</span> is driven by purpose, and powered by four industry-leading businesses, unique global capabilities, and a highly experienced and diverse team,\" said <span class=\"xn-money\">3M</span> chairman and chief executive officer <span class=\"xn-person\">Mike Roman</span>. \"We are relentlessly focused on serving our customers, investing in innovation, and taking important actions to drive performance in an uncertain macroeconomic environment. The changes we are making will improve our performance and ability to deliver for customers and shareholders.\"",
			"<b>Preliminary Shareholder Voting Results</b>",
			"3M shareholders today voted on four business items:",
			"1)  Shareholders elected 10 directors for one-year terms that expire at the company's 2024 Annual Meeting:",
			"2)  Shareholders ratified the appointment of PricewaterhouseCoopers LLP as 3M's independent registered public accounting firm for 2023.",
			"3)  Shareholders approved, on an advisory basis, executives' compensation as described in the proxy statement.",
			"4)  Shareholders approved, on an advisory basis, the frequency of every one year in conducting an advisory vote on executive compensation.",
			"3M will disclose the final voting results on each item of business properly presented at the Annual Meeting on Form 8-K to be filed with the SEC.",
			"<b>Forward-Looking Statements<br/></b>This news release contains forward-looking information about 3M's financial results and estimates and business prospects that involve substantial risks and uncertainties. You can identify these statements by the use of words such as \"anticipate, \"estimate,\" \"expect,\" \"aim,\" \"project,\" \"intend,\" \"plan,\" \"believe,\" \"will,\" \"should,\" \"could,\" \"target,\" \"forecast\" and other words and terms of similar meaning in connection with any discussion of future operating or financial performance or business plans or prospects. Among the factors that could cause actual results to differ materially are the following: (1) worldwide economic, political, regulatory, international trade, geopolitical, capital markets and other external conditions and other factors beyond the Company's control, including inflation, recession, military conflicts, natural and other disasters or climate change affecting the operations of the Company or its customers and suppliers; (2) risks related to unexpected events such as the public health crises associated with the coronavirus (COVID-19) global pandemic; (3) foreign currency exchange rates and fluctuations in those rates; (4) risks related to certain fluorochemicals, including liabilities related to claims, lawsuits, and government regulatory proceedings concerning various PFAS-related products and chemistries, as well as risks related to the Company's plans to exit PFAS manufacturing and discontinue use of PFAS across its product portfolio; (5) legal proceedings, including significant developments that could occur in the legal and regulatory proceedings described in the Company's Annual Report on Form 10-K for the year ended <span class=\"xn-chron\">Dec. 31, 2022</span> and any subsequent quarterly reports on Form 10-Q (the \"Reports\"); (6) competitive conditions and customer preferences; (7) the timing and market acceptance of new product and service offerings; (8) the availability and cost of purchased components, compounds, raw materials and energy due to shortages, increased demand and wages,  supply chain interruptions, or natural or other disasters; (9) unanticipated problems or delays with the phased implementation of a global enterprise resource planning (ERP) system, or security breaches and other disruptions to the Company's information technology infrastructure; (10) the impact of acquisitions, strategic alliances, divestitures, and other strategic events resulting from portfolio management actions and other evolving business strategies; (11) operational execution, including the extent to which the Company can realize the benefits of planned productivity improvements, as well as the impact of organizational restructuring activities; (12) financial market risks that may affect the Company's funding obligations under defined benefit pension and postretirement plans; (13) the Company's credit ratings and its cost of capital; (14) tax-related external conditions, including changes in tax rates, laws or regulations; (15) matters relating to the proposed spin-off of the Company's Health Care business; and (16) matters relating to the voluntary chapter 11 proceedings of the Company's subsidiary Aearo Technologies and certain of its affiliates. Changes in such assumptions or factors could produce significantly different results. A further description of these factors is located in the Reports under \"Cautionary Note Concerning Factors That May Affect Future Results\" and \"Risk Factors\" in Part I, Items 1 and 1A (Annual Report) and in Part I, Item 2 and Part II, Item 1A (Quarterly Reports). The Company assumes no obligation to update any forward-looking statements discussed herein as a result of new information or future events or developments.",
			"<b>About <span class=\"xn-money\">3M</span><br/></b><span class=\"xn-money\">3M</span> believes science helps create a brighter world for everyone. By unlocking the power of people, ideas and science to reimagine what's possible, our global team uniquely addresses the opportunities and challenges of our customers, communities, and planet. Learn how we're working to improve lives and make what's next at <a class=\"link\" data-ylk=\"slk:3M.com/news ;elm:context_link;itc:0\" href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3860541-1&amp;h=3233693214&amp;u=https%3A%2F%2Fnews.3m.com%2F&amp;a=3M.com%2Fnews%C2%A0\" rel=\"nofollow noopener\" target=\"_blank\"><span class=\"xn-money\">3M</span>.com/news </a>or on Twitter at <a class=\"link\" data-ylk=\"slk:@3M ;elm:context_link;itc:0\" href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3860541-1&amp;h=3290715187&amp;u=https%3A%2F%2Ftwitter.com%2F3M%2F&amp;a=%403M%C2%A0\" rel=\"nofollow noopener\" target=\"_blank\">@3M </a>or <a class=\"link\" data-ylk=\"slk:@3MNews;elm:context_link;itc:0\" href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3860541-1&amp;h=2760970266&amp;u=https%3A%2F%2Ftwitter.com%2F3MNews&amp;a=%403MNews\" rel=\"nofollow noopener\" target=\"_blank\">@3MNews</a>.",
			"Please note that the company announces material financial, business and operational information using the <span class=\"xn-money\">3M</span> investor relations website, SEC filings, press releases, public conference calls and webcasts. The company also uses the <span class=\"xn-money\">3M</span> news center and social media to communicate with our customers and the public about the company, products and services and other matters. It is possible that the information <span class=\"xn-money\">3M</span> posts on the news center and social media could be deemed to be material information. Therefore, the company encourages investors, the media and others interested in <span class=\"xn-money\">3M</span> to review the information posted on 3M's News Center and the social media channels such as Twitter @3M or @3MNews.",
			"<b>Contacts <br/></b><b>3M <br/>Investor Contacts: <br/></b><span class=\"xn-person\">Bruce Jermeland</span>, 651-733-1807 <br/>or <br/><span class=\"xn-person\">Diane Farrow</span>, 612-202-2449 <br/>or <br/><b>Media contact: <br/></b>Tim Post, <a class=\"link\" data-ylk=\"slk:tpost3@mmm.com;elm:context_link;itc:0\" href=\"mailto:tpost3@mmm.com\" rel=\"nofollow\">tpost3@mmm.com</a>",
			" ",
			" ",
			"View original content to download multimedia:<a class=\"link\" data-ylk=\"slk:https://www.prnewswire.com/news-releases/3m-annual-meeting-highlights-business-portfolio-innovation-and-actions-to-drive-future-performance-301819718.html;elm:context_link;itc:0\" href=\"https://www.prnewswire.com/news-releases/3m-annual-meeting-highlights-business-portfolio-innovation-and-actions-to-drive-future-performance-301819718.html\" rel=\"nofollow noopener\" target=\"_blank\">https://www.prnewswire.com/news-releases/3m-annual-meeting-highlights-business-portfolio-innovation-and-actions-to-drive-future-performance-301819718.html</a>",
			"SOURCE <span class=\"xn-money\">3M</span>"
		]
	},
	{
		"title": "Boeing Sells 150 Planes, UAA Beats but Lowers",
		"keyword": [
			"debt ceiling",
			"earnings reports",
			"investment calendar",
			"UnderArmour",
			"Q1 earnings season",
			"John Williams",
			"fiscal Q4 earnings"
		],
		"provider": "Zacks",
		"datepublished": "2023-05-09T14:29:02.000Z",
		"content": [
			"<strong>Tuesday, May 9th, 2023</strong><br/><br/>It’s a busy time on the investment calendar, for sure: Q1 earnings season is still barely halfway over, economic prints on our present inflation situation, political brinksmanship (playing chicken with the debt ceiling) in Washington DC and continuing drama over regional banks destabilizing are all vying for attention. Yet this morning, we’re a little quiet here in the office.<br/><br/>Mostly, that’s because the biggest news items scheduled for this week — tomorrow morning’s <strong>Consumer Price Index (CPI) </strong>tomorrow afternoon’s <strong>Walt Disney Co. DIS </strong>earnings report — haven’t happened yet. There are no major economic prints hitting the tape before today’s opening bell. After the bell, we will hear from Fed Governor Philip Jefferson and New York Fed President John Williams. And after today’s close, we’ll see new earnings reports from <strong>Airbnb ABNB</strong>, <strong>Twilio TWLO</strong> and <strong>Wynn Resorts WYNN</strong>, among others.<br/><br/>This morning, <strong>UnderArmour UAA</strong> put out fiscal Q4 earnings results ahead of today’s open, improving over estimates on both top and bottom lines for the quarter. Earnings of 18 cents per share outpaced the 15 cents in the Zacks consensus (and vastly improved from the year-ago -$0.01 per share), for its third positive earnings surprise in the past four quarters. Revenues of $1.4 billion surpassed expectations on the top line by +1.23%, and beat the year-ago quarter by +7.7%.<br/><br/>Yet inventory issues — clearing out excessive glut of merchandise by way of offering additional promotions for longer — is expected to hit gross margins at UnderArmour going forward. Thus, fiscal year EPS for the company has been lowered to 47-51 cents; the Zacks consensus had previously been for 54 cents per share. This has led shares to come down -5% in today’s pre-market session. For more on UAA’s earnings, click here.<br/><br/>Also this morning, 150 new 737 MAX-10 planes have been ordered from<strong> Boeing BA</strong> by its long-time partner <strong>Ryanair RYAAY</strong> for a list price of $40.2 billion. (This is not the price Ryanair will ultimately pay for these planes; this would be the price you or I would be expected to pay if we were to try and buy them.) Assembly is expected to begin in 2024 and deliveries to begin in 2027. Both companies are up roughly +1% in pre-market trading on the news.<br/><br/>Otherwise, early market traders are in a giving mood this morning — the Dow is -80 points at this hour, the Nasdaq is -70 and the S&amp;P 500 -15 points — from yesterday’s flat trading day overall. Perhaps we’ll see some market moves on the Fed officials’ take about interest rates, the debt ceiling, etc., but much more likely we’ll need to wait for tomorrow’s sub-5% (hopefully) CPI headline, year over year.<br/><br/>Questions or comments about this article and/or its author? Click here&gt;&gt;",
			"Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. <a class=\"link\" data-ylk=\"slk:Click to get this free report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp/?ALERT=RPT_7BEST_YHOSYND&amp;ADID=SYND_YAHOO_7BEST_AHEADOFWALLSTREET&amp;cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">Click to get this free report</a>",
			"<a class=\"link\" data-ylk=\"slk:The Boeing Company (BA) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=BA&amp;ADID=SYND_YAHOO_TCK_AHEADOFWALLSTREET&amp;cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">The Boeing Company (BA) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:Ryanair Holdings PLC (RYAAY) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=RYAAY&amp;ADID=SYND_YAHOO_TCK_AHEADOFWALLSTREET&amp;cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">Ryanair Holdings PLC (RYAAY) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:Wynn Resorts, Limited (WYNN) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=WYNN&amp;ADID=SYND_YAHOO_TCK_AHEADOFWALLSTREET&amp;cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">Wynn Resorts, Limited (WYNN) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:The Walt Disney Company (DIS) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=DIS&amp;ADID=SYND_YAHOO_TCK_AHEADOFWALLSTREET&amp;cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">The Walt Disney Company (DIS) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:Twilio Inc. (TWLO) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=TWLO&amp;ADID=SYND_YAHOO_TCK_AHEADOFWALLSTREET&amp;cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">Twilio Inc. (TWLO) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:Under Armour, Inc. (UAA) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=UAA&amp;ADID=SYND_YAHOO_TCK_AHEADOFWALLSTREET&amp;cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">Under Armour, Inc. (UAA) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:Airbnb, Inc. (ABNB) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=ABNB&amp;ADID=SYND_YAHOO_TCK_AHEADOFWALLSTREET&amp;cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">Airbnb, Inc. (ABNB) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:To read this article on Zacks.com click here.;elm:context_link;itc:0\" href=\"https://www.zacks.com/stock/news/2092425/boeing-sells-150-planes-uaa-beats-but-lowers?cid=CS-YAHOO-FT-ahead_of_wall_street-2092425\" rel=\"nofollow noopener\" target=\"_blank\">To read this article on Zacks.com click here.</a>",
			"<a class=\"link\" data-ylk=\"slk:Zacks Investment Research;elm:context_link;itc:0\" href=\"https://www.zacks.com/\" rel=\"nofollow noopener\" target=\"_blank\">Zacks Investment Research</a>",
			"<a class=\"link\" data-ylk=\"slk:Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp/?ALERT=RPT_7BEST_YHOSYND&amp;ADID=ZACKS_PFP_7BEST_ETF\" rel=\"nofollow noopener\" target=\"_blank\">Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report</a>"
		]
	},
	{
		"title": "Boeing Wins Landmark Order from Ryanair for 300 737 Max 10 Jets",
		"keyword": [
			"Ryanair Holdings Plc",
			"Boeing",
			"Bloomberg",
			"Michael O’Leary",
			"737 Max aircraft",
			"European carriers"
		],
		"provider": "Bloomberg",
		"datepublished": "2023-05-09T14:27:13.000Z",
		"content": [
			"(Bloomberg) -- Boeing Co. secured a landmark order from one of its most important customers, with Ryanair Holdings Plc agreeing to purchase as many as 300 of the company’s largest 737 Max aircraft in a bet on the post-pandemic travel recovery.",
			"The order, made up of 150 firm purchases and the same number of options, has a list value of $40 billion, Boeing and Ryanair said in a statement Tuesday, though major deals typically command big discounts. Boeing shares jumped as much as 3.7% in New York, while Ryanair, Europe’s largest discount carrier, advanced 2.1% in Dublin.",
			"The huge commitment to Boeing’s largest 737 variant marks an important endorsement from one of the US manufacturer’s most loyal customers and highlights how carriers are willing to splurge on fleet upgrades again as air travel rebounds. Ryanair said the deal — the largest order ever placed by an Irish company for US manufactured goods — was more expensive than its current crop of 737 deliveries.",
			"“We paid more per seat but we’re still incredibly happy with the deal we’ve done,” Chief Executive Officer Michael O’Leary said at a news conference. “We think the extra seats give us the revenue-earning potential.”",
			"Deliveries will start in 2027 and run through 2033. Ryanair said discussions surrounding the purchase started in January, and half the order is earmarked for replacement of older 737NG models while the other half is reserved for growth.",
			"By 2034, Ryanair will expand to carrying 300 million passengers, targeting market share in Europe of about 30%, O’Leary said. The airline will have about 550 aircraft by the middle of this year and increase that number to 800 over the next decade, he said.",
			"Biggest Buyer",
			"Ryanair is Boeing’s biggest buyer in Europe, having built its entire fleet of short-haul aircraft around the workhorse 737. O’Leary said in late March that the airline had resumed talks with Boeing more aircraft.",
			"The Covid-era shutdown of some European carriers and scaling back at others has created openings for Ryanair. O’Leary has cited growth in Italy, where Alitalia was succeeded by the smaller ITA, in Portugal, where state-ward TAP is now up for sale, and markets in Ireland and Spain, where incumbents were slow to restore capacity, as providing Ryanair with ample opportunity for growth.",
			"The budget airline is among companies that have predicted a summer booking surge, particularly on shorter-haul routes to sunny destinations like Spain or Italy. British-Airways parent IAG SA raised its forecast for the year last week.",
			"Ryanair joins other airlines expanding their fleets, having repaired their balance sheets and repaid government loans. Deutsche Lufthansa AG said in March that it would buy 22 new widebody aircraft from Airbus SE and Boeing in an order valued at $7.5 billion at list price. A month earlier, Air India Ltd. announced a 470-plane order with the two manufacturers in the largest purchase in commercial aviation history to date.",
			"Some Delays",
			"The 737 Max 10 hasn’t been without hiccups. Boeing now expects the US Federal Aviation Administration to begin certification flights for the long-delayed aircraft this year, with the first deliveries expected in 2024. In December, US lawmakers struck a deal to exempt still uncertified Max 7 and 10 models from a a new cockpit requirement that would have taken effect at the start of 2023 and potentially set back deliveries further.",
			"Boeing CEO David Calhoun said at the presentation that he still expects certification of the aircraft in 2024.",
			"Airlines that have committed to the 737 Max 10 include Delta Air Lines Inc., United Airlines Holdings Inc. and IAG. The aircraft competes with Airbus’s bestselling A321neo, as carriers migrate toward the biggest versions of the most widely flown narrow-body jets.",
			"Along with legacy carriers, Ryanair competes with Budapest-based Wizz Air Holdings Plc, which is ramping up operations in its Eastern Europe stronghold, as well as expanding west. The carrier operates the bigger 239-seat Airbus A321neo.",
			"New Phase",
			"“It was axiomatic that Ryanair would order the higher-gauge Boeing plane, as the only aircraft that enables it to stand toe-to-toe with Wizz Air on unit cost,” wrote Alex Irving, an analyst at Bernstein, in a research note. “This is the turning point” as growth slows and the Irish carrier focuses more on cash generation.",
			"Ryanair previously topped up its order for the 737 Max 8 version with a special high-density configuration to a total of 210 aircraft. It has already received about 100 of the airliner. The airline has continuously bought larger aircraft to expand capacity, going from the 737-800 with 189 seats to the Max 200 with 197 to the Max 10, which will have room for 230.",
			"With the Max 200, O’Leary claimed in January that there’s a widening cost gap between Ryanair and other European carriers. The even-larger Max 10 now gives him another weapon.",
			"“You keep building them, and we’ll keep buying them,” O’Leary said.",
			"--With assistance from Kate Duffy.",
			"(Updates with growth projection in sixth paragraph, updates shares)",
			"©2023 Bloomberg L.P."
		]
	},
	{
		"title": "Jacobs to spin-off government services unit to streamline operations",
		"keyword": [
			"Jacobs Solutions Inc",
			"Critical Mission Solutions",
			"Jacobs",
			"Jacobs Solutions"
		],
		"provider": "Reuters",
		"datepublished": "2023-05-09T14:23:53.000Z",
		"content": [
			"May 9 (Reuters) - Engineering and consulting firm Jacobs Solutions Inc said on Tuesday it will spin-off its government services unit in a move to streamline its operations and boost margins.",
			"Jacobs joins a raft of U.S. manufacturing companies, including General Electric Co, who have moved to cut costs and simplify businesses over the past two years.",
			"Shares of the company were up 3.4% at $121.3 in morning trade after the Dallas, Texas-based company said it will complete the separation in the second half of fiscal year 2024.",
			"The Critical Mission Solutions (CMS) business which provides services such as consulting and data analytics to U.S. and foreign governments will be spun-off to Jacobs' shareholders, details of which would be made public at a later date, the company said.",
			"CMS president Steve Arnette will continue to lead the business after the spin-off is completed.",
			"Jacobs Solutions said Centerview Partners LLC and Perella Weinberg Partners LP are serving as financial advisers to the company, while Wachtell, Lipton, Rosen &amp; Katz is serving as legal adviser.",
			"(Reporting by Shivansh Tiwary in Bengaluru; Editing by Krishna Chandra Eluri)"
		]
	},
	{
		"title": "TransDigm (TDG) Beats on Q2 Earnings, Ups '23 EPS View",
		"keyword": [
			"TransDigm Group",
			"Consensus Estimate",
			"reported figure",
			"Zacks Rank",
			"Transdigm Group Incorporated",
			"The bottom line"
		],
		"provider": "Zacks",
		"datepublished": "2023-05-09T14:17:02.000Z",
		"content": [
			"<strong>TransDigm Group Incorporated</strong> TDG reported fiscal second-quarter 2023 adjusted earnings of $5.98 per share, which beat the Zacks Consensus Estimate of $5.46 by 9.5%. The bottom line also improved a solid 54.9% from the prior-year quarter’s reported figure of $3.86.",
			"Barring one-time items, the company reported GAAP earnings of $5.32 per share compared with $3.38 in the year-ago period.",
			"Net sales amounted to $1,592 million, up 20% from $1,327 million in the prior-year quarter. The reported figure also beat the Zacks Consensus Estimate of $1,498 million by 6.3%.",
			"Transdigm Group Incorporated price-consensus-eps-surprise-chart | Transdigm Group Incorporated Quote",
			"Gross profit for the quarter was $929 million, up 26.2% from the year-ago period’s $736 million.",
			"Income from continuing operations increased 42.7% year over year to $533 million. This improvement was primarily due to a rise in net sales and a favorable sales mix.",
			"Cash and cash equivalents as of Apr 1, 2023 were $3,418 million compared with $3,001 million as of Sep 30, 2022.",
			"At the end of the fiscal second quarter, TDG’s long-term debt was $19.35 billion compared with $19.37 billion as of Sep 30, 2022.",
			"Cash from operating activities increased to $507 million from $366 million at the end of fiscal second-quarter 2022.",
			"TransDigm raised its guidance for fiscal 2023. The company now expects sales in the range of $6,410-$6,500 million compared with the prior projection of $6,070-$6,240 million. The Zacks Consensus Estimate for the company’s full-year sales is pegged at $6.18 billion, lower than the company’s guided range.",
			"TDG also currently expects adjusted earnings of $23.31-$24.19 per share for fiscal 2023, compared with the prior guidance of $21.47-$22.87 per share. The Zacks Consensus Estimate for full-year earnings is pegged at $22.36 per share, lower than the company’s guided range.",
			"TransDigm currently carries a Zacks Rank #3 (Hold). You can see <strong>the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.</strong>",
			"<strong>The Boeing Company</strong> BA incurred an adjusted loss of $1.27 per share in the first quarter of 2023, wider than the Zacks Consensus Estimate of a loss of 98 cents. However, the figure improved from the year-ago quarter’s reported loss of $2.75 per share.",
			"Boeing’s revenues amounted to $17.92 billion, which beat the Zacks Consensus Estimate of $17.36 billion by 3.3%. The top line also improved 28% from the year-ago quarter’s reported figure of $13.99 billion.",
			"<strong>Hexcel Corporation</strong> HXL reported first-quarter 2023 adjusted earnings of 50 cents per share, which beat the Zacks Consensus Estimate of 39 cents by 28.2%. The bottom line also improved massively from the year-ago quarter’s level of 22 cents, highlighting solid growth of 127.3%.",
			"The company registered GAAP earnings of 50 cents per share compared with the prior-year quarter’s 21 cents.",
			"<strong>Lockheed Martin Corporation</strong> LMT reported first-quarter 2023 adjusted earnings of $6.43 per share, which outpaced the Zacks Consensus Estimate of $6.07 by 5.9%. However, the bottom line was on par with the year-ago quarter's level.",
			"Net sales amounted to $15.13 billion in the reported quarter, which outpaced the Zacks Consensus Estimate of $14.87 billion by 1.9%. The top line also rose 1.1% from $14.96 billion a year ago.",
			"Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. <a class=\"link\" data-ylk=\"slk:Click to get this free report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp/?ALERT=RPT_7BEST_YHOSYND&amp;ADID=SYND_YAHOO_7BEST_ANALYSTBLOG_210&amp;cid=CS-YAHOO-FT-analyst_blog|earnings_article-2092415\" rel=\"nofollow noopener\" target=\"_blank\">Click to get this free report</a>",
			"<a class=\"link\" data-ylk=\"slk:The Boeing Company (BA) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=BA&amp;ADID=SYND_YAHOO_TCK_ANALYSTBLOG_210&amp;cid=CS-YAHOO-FT-analyst_blog|earnings_article-2092415\" rel=\"nofollow noopener\" target=\"_blank\">The Boeing Company (BA) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:Lockheed Martin Corporation (LMT) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=LMT&amp;ADID=SYND_YAHOO_TCK_ANALYSTBLOG_210&amp;cid=CS-YAHOO-FT-analyst_blog|earnings_article-2092415\" rel=\"nofollow noopener\" target=\"_blank\">Lockheed Martin Corporation (LMT) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:Transdigm Group Incorporated (TDG) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=TDG&amp;ADID=SYND_YAHOO_TCK_ANALYSTBLOG_210&amp;cid=CS-YAHOO-FT-analyst_blog|earnings_article-2092415\" rel=\"nofollow noopener\" target=\"_blank\">Transdigm Group Incorporated (TDG) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:Hexcel Corporation (HXL) : Free Stock Analysis Report;elm:context_link;itc:0\" href=\"https://www.zacks.com/registration/pfp?ALERT=YAHOO_ZER&amp;d_alert=ZER_CONF&amp;t=HXL&amp;ADID=SYND_YAHOO_TCK_ANALYSTBLOG_210&amp;cid=CS-YAHOO-FT-analyst_blog|earnings_article-2092415\" rel=\"nofollow noopener\" target=\"_blank\">Hexcel Corporation (HXL) : Free Stock Analysis Report</a>",
			"<a class=\"link\" data-ylk=\"slk:To read this article on Zacks.com click here.;elm:context_link;itc:0\" href=\"https://www.zacks.com/stock/news/2092415/transdigm-tdg-beats-on-q2-earnings-ups-23-eps-view?cid=CS-YAHOO-FT-analyst_blog|earnings_article-2092415\" rel=\"nofollow noopener\" target=\"_blank\">To read this article on Zacks.com click here.</a>",
			"<a class=\"link\" data-ylk=\"slk:Zacks Investment Research;elm:context_link;itc:0\" href=\"https://www.zacks.com/\" rel=\"nofollow noopener\" target=\"_blank\">Zacks Investment Research</a>"
		]
	}
]